In [1]:
import pandas as pd
import numpy as np

ser = pd.Series([])
ser

C:\Users\Aryan\AppData\Local\Temp\ipykernel_23672\2327878233.py:4: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series([])

Series([], dtype: float64)

In [2]:
ser = pd.Series([0, 10, 20, 30 ,40, 50]) 
ser

0     0
1    10
2    20
3    30
4    40
5    50
dtype: int64

In [3]:
ser = pd.Series([0, 10, 20, 30 ,40, 50, '10'])
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    10
dtype: object

In [4]:
dict = {
    'A' : [1, 2, 5],
    'B' : [5, 8, 9],
    'C' : [1, 2, 3]
}
df = pd.DataFrame(dict)
df

   A  B  C
0  1  5  1
1  2  8  2
2  5  9  3

In [5]:
df['D'] = 'one two three'.split() # split() is used to split the string into list
df

   A  B  C      D
0  1  5  1    one
1  2  8  2    two
2  5  9  3  three

In [6]:
df['E'] = [10, 20, 30]
df

   A  B  C      D   E
0  1  5  1    one  10
1  2  8  2    two  20
2  5  9  3  three  30

**How to Create Missing Data nan values in data frame**

In [7]:
dict1 = {
    'A' : [1, 2, np.nan],
    'B' : [5, np.nan, np.nan],
    'C' : [1, 2, 3],
    'D' : [20, 25, 30]
}

df1 = pd.DataFrame(dict1) # creating a dataframe from dictionary
df1

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  25
2  NaN  NaN  3  30

In [8]:
df1.dropna(axis=1) # axis=1 means drop the column with NaN values

   C   D
0  1  20
1  2  25
2  3  30

In [9]:
df1 # df1 is not changed

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  25
2  NaN  NaN  3  30

In [10]:
df1.dropna(axis=0) # axis=0 means drop the row with NaN values
df1

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  NaN  2  25
2  NaN  NaN  3  30

In [11]:
df1.fillna(value=50)

      A     B  C   D
0   1.0   5.0  1  20
1   2.0  50.0  2  25
2  50.0  50.0  3  30

In [12]:
df1.fillna(value=df1['C'].mean())

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  25
2  2.0  2.0  3  30

In [13]:
df1.fillna(value=df1['C'].mean(), inplace=True) # inplace=True means change the df1
df1

     A    B  C   D
0  1.0  5.0  1  20
1  2.0  2.0  2  25
2  2.0  2.0  3  30

**Groupby**

In [14]:
dict2 = {
    'company' : ['Google', 'Google', 'Microsoft', 'Microsoft', 'Facebook', 'Facebook'],
    'person' : ['Aryan', 'Mayank', 'Neetesh', 'Ojshav', 'Ashish', 'Avinash'],
    'sales' : [200, 120, 340, 124, 243, 350],
    'profit' : [34, 12, 90, 29, 54, 66]
}
df2 = pd.DataFrame(dict2)
df2

     company   person  sales  profit
0     Google    Aryan    200      34
1     Google   Mayank    120      12
2  Microsoft  Neetesh    340      90
3  Microsoft   Ojshav    124      29
4   Facebook   Ashish    243      54
5   Facebook  Avinash    350      66

In [15]:
bycomp = df2.groupby('company').mean() # groupby() is used to group the data by company
bycomp

C:\Users\Aryan\AppData\Local\Temp\ipykernel_23672\961781688.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  bycomp = df2.groupby('company').mean() # groupby() is used to group the data by company

           sales  profit
company
Facebook   296.5    60.0
Google     160.0    23.0
Microsoft  232.0    59.5

In [16]:
bycomp = df2.groupby('company')[['sales', 'profit']].sum()
bycomp

           sales  profit
company
Facebook     593     120
Google       320      46
Microsoft    464     119

In [17]:
bycomp = df2.groupby('company')[['sales', 'profit']].agg(['sum', 'mean']) # agg() is used to aggregate the data by sum and mean
bycomp

          sales        profit
            sum   mean    sum  mean
company
Facebook    593  296.5    120  60.0
Google      320  160.0     46  23.0
Microsoft   464  232.0    119  59.5